In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('cast.csv')

In [14]:
df.head(2)

                            title  year       name   type character     n
0                 Suuri illusioni  1985     Homo $  actor    Guests  22.0
1  Gangsta Rap: The Glockumentary  2007  Too $hort  actor   Himself   NaN

## 1. How many movies have the title "Hamlet"?

In [28]:
df[df["title"]=="Hamlet"].shape[0]

299

## 2.	List all of the "Treasure Island" movies from earliest to most recent.

In [29]:
filt = df['title'] == 'Treasure Island'

In [30]:
df.loc[filt].sort_values('year', ascending = True).tail(10)

,title,year,name,type,character,n
898356,Treasure Island,1999,George Hirschmann,actor,Admiral,12.0
2239082,Treasure Island,1999,Caveh Zahedi,actor,Harold,9.0
1075489,Treasure Island,1999,Scott King,actor,Walter,15.0
1273059,Treasure Island,1999,J.P. Manoux,actor,Officer Hughes,18.0
1516861,Treasure Island,1999,Nick Offerman,actor,Samuel,2.0
1663860,Treasure Island,1999,Victor Raider-Wexler,actor,Samowitz,10.0
1731182,Treasure Island,1999,Scot Thomas Robinson,actor,Jimmy,11.0
1813707,Treasure Island,1999,Richard Schave,actor,Man,21.0
2710458,Treasure Island,1999,Stephanie Ittleson,actress,Stella,7.0
815338,Treasure Island,1999,Rio Hackford,actor,Hans,23.0

## 3. How many roles were credited in the silent 1921 version of Hamlet?

In [31]:
filt = (df['title'] == 'Hamlet') & (df['year'] == 1921)

In [36]:
df.loc[filt].head()

          title  year              name   type     character    n
6710     Hamlet  1921  Fritz Achterberg  actor   Fortinbras,  9.0
408456   Hamlet  1921      Paul Conradi  actor  K?nig Hamlet  2.0
495468   Hamlet  1921  Anton De Verdier  actor       Laertes  7.0
1015046  Hamlet  1921   Hans Junkermann  actor      Polonius  6.0
1948795  Hamlet  1921      Heinz Stieda  actor       Horatio  5.0

In [40]:
df[filt]["character"].unique().shape[0]

9

In [20]:
df.loc[filt].shape[0]

9

## 4.	Use groupby() to plot the number of "Hamlet" films made each decade

In [63]:
title_grp = df.groupby(['title'])

In [64]:
hamlet_grp = title_grp.get_group('Hamlet')

In [65]:
# How many 'Hamlet' films were made in each year?
ham_srs = hamlet_grp['year'].value_counts()

In [66]:
hamlet_grp["year"]

1456       1996
6710       1921
10274      2009
10275      2009
12743      1913
           ...
3212647    1964
3236803    1969
3257437    2000
3284728    1996
3304265    1996
Name: year, Length: 299, dtype: int64

In [67]:
ham_srs

1996    55
2000    38
1964    33
1990    29
1948    25
1969    24
1913    21
2009    17
2011    12
1976    11
1921     9
1973     8
1911     6
2015     6
1987     3
1910     1
1954     1
Name: year, dtype: int64

In [68]:
filt = ( (df['year'] >= 1970) & (df['year'] <= 1979) )

In [69]:
# How many 'Hamlet' films were made in the 1910's ?
hamlet_grp.loc[filt].shape[0]

19

In [70]:
data = {
    'Decade': pd.Series(['1910s','1920s','1930s','1940s','1950s','1960s','1970s','1980s','1990s','2000s', '2010s']),
    'Num of Hamlet films': 0
}

ham_dec = pd.DataFrame(data)

ham_dec

   Decade  Num of Hamlet films
0   1910s                    0
1   1920s                    0
2   1930s                    0
3   1940s                    0
4   1950s                    0
5   1960s                    0
6   1970s                    0
7   1980s                    0
8   1990s                    0
9   2000s                    0
10  2010s                    0

In [71]:
i = 0
while i < 11:
    year = 1910 + i*10
    filt = ( (df['year'] >= year) & (df['year'] <= year+9) )
    ham_dec.iloc[i,1] = hamlet_grp.loc[filt].shape[0]
    i += 1

In [72]:
ham_dec

   Decade  Num of Hamlet films
0   1910s                   28
1   1920s                    9
2   1930s                    0
3   1940s                   25
4   1950s                    1
5   1960s                   57
6   1970s                   19
7   1980s                    3
8   1990s                   84
9   2000s                   55
10  2010s                   18

## 5.	How many leading (n=1) roles were available to actors, and how many to actresses, in each year of the 1950s?   
v

In [73]:
filt1 = ( (df['year'] >= 1950) & (df['year'] <= 1959) )

In [74]:
filt2 = df['n'] == 1

In [75]:
filt3 = df['type'] == 'actor'

In [76]:
# actors
df.loc[filt1].loc[filt2].loc[filt3].shape[0]

6388

In [77]:
filt3 = df['type'] == 'actress'

In [78]:
# actresses
df.loc[filt1].loc[filt2].loc[filt3].shape[0]

2813

## 6.	List the 10 actors/actresses that have the most leading roles (n=1) since the 1990's.
v

In [79]:
filt1 = df['year'] >= 1990

In [80]:
df.loc[filt1].loc[filt2]['name'].value_counts().head(10)

Mohanlal              126
Mammootty             118
Akshay Kumar           87
Jayaram                76
Andy Lau               72
Ajay Devgn             69
Eric Roberts           68
Amitabh Bachchan       68
Nagarjuna Akkineni     60
Dilip                  59
Name: name, dtype: int64

## 7.	List, in order by year, each of the films in which Frank Oz has played more than 1 role
v

In [81]:
filt = df['name'] == 'Frank Oz'

In [82]:
frank = df.loc[filt]

In [83]:
frank = frank.sort_values('year', ascending = True)

In [84]:
s = frank['title'].value_counts()

In [85]:
s[s>1]

The Muppet Movie                            8
The Muppets Take Manhattan                  7
The Muppet Christmas Carol                  7
The Great Muppet Caper                      6
Muppets from Space                          4
Muppet Treasure Island                      4
Sesame Street Presents: Follow that Bird    3
The Adventures of Elmo in Grouchland        3
An American Werewolf in London              2
The Dark Crystal                            2
Name: title, dtype: int64